"""
문제 설명:
이 문제는 음이 아닌 정수로 이루어진 배열에서 홀수와 짝수가 인접한 경우를 최대 1번만 등장하도록 만들기 위한 최소 교환 횟수를 구하는 문제입니다.

1. 배열 A의 길이는 N입니다.
2. 인접한 두 수를 원하는 만큼 교환할 수 있습니다.
3. 홀수와 짝수가 인접한 경우가 최대 1번만 등장하도록 해야 합니다.
4. 0은 짝수로 간주합니다.

이 문제의 핵심 아이디어는 다음과 같습니다:
- 홀수와 짝수를 분리하여 한쪽에 모으면, 홀수와 짝수의 경계는 최대 1번만 발생합니다.
- 따라서 모든 홀수를 왼쪽으로, 모든 짝수를 오른쪽으로 모으거나, 또는 모든 짝수를 왼쪽으로, 모든 홀수를 오른쪽으로 모으는 두 가지 방법 중 더 적은 교환 횟수를 선택하면 됩니다.
- 버블 정렬의 원리를 이용하면, 교환 횟수는 정렬 과정에서 발생하는 '역전된 쌍(inversion)'의 수와 같습니다.
"""

def solve():
    N = int(input())  # 배열의 길이 N을 입력받습니다.
    num_list = list(map(int, input().split()))  # 배열의 원소들을 입력받습니다.

    # 각 타입별 카운터 초기화
    even_cnt = 0  # 현재까지 처리한 홀수의 개수
    odd_cnt = 0   # 현재까지 처리한 짝수의 개수
    even_sum_cnt = 0  # 홀수를 왼쪽으로 모을 때 필요한 교환 횟수
    odd_sum_cnt = 0   # 짝수를 왼쪽으로 모을 때 필요한 교환 횟수

    for num in num_list:

        # 홀수인 경우
        if num % 2:
            # 홀수가 왼쪽으로 가야 할 경우, 현재까지 나온 짝수의 개수만큼 교환이 필요합니다.
            # 이는 홀수를 왼쪽으로 옮기려면 앞에 있는 모든 짝수를 건너뛰어야 하기 때문입니다.
            even_cnt += 1
            odd_sum_cnt += odd_cnt

        # 짝수인 경우
        else:
            # 짝수가 왼쪽으로 가야 할 경우, 현재까지 나온 홀수의 개수만큼 교환이 필요합니다.
            # 이는 짝수를 왼쪽으로 옮기려면 앞에 있는 모든 홀수를 건너뛰어야 하기 때문입니다.
            odd_cnt += 1
            even_sum_cnt += even_cnt

    # 두 가지 방법(홀수를 왼쪽으로 또는 짝수를 왼쪽으로) 중 더 적은 교환 횟수를 선택합니다.
    print(min(even_sum_cnt, odd_sum_cnt))

if __name__ == '__main__':
    solve()